Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier.AffectedRebarEnum Enumeration
 This enum allows the caller to specify which end of the bar is of interest when calling the function GetAffectedBars.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AffectedRebarEnum
Public Enumeration AffectedRebarEnum
Members
Member name | Value | Description
START | 0 |  Gets bars that are affected at their start.
END | 1 |  Gets bars that affected at their end.
EITHER | 2 |  Gets all bars affected by the modifier.
See Also
Reference
Tekla.Structures.Model Namespace